---
kind: method
id: M:Autodesk.Revit.DB.CurveByPoints.GetVisibility
source: html/f688bb4d-b4f6-0e61-ba0c-2216b200e05f.htm
---
# Autodesk.Revit.DB.CurveByPoints.GetVisibility Method

Gets the visibility.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the curve.